config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2020-04-25 Sat 10:22 -->
    <meta http-equiv="Content-Type"
    content="text/html;charset=utf-8" />
    <meta name="viewport"
    content="width=device-width, initial-scale=1" />
    <title>Emacs doom configuration</title>
    <meta name="generator" content="Org mode" />
    <meta name="author" content="Yarin miran" />
  </head>
  <body>
    <div id="content">
      <h1 class="title">Emacs doom configuration</h1>
      <div id="table-of-contents">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents">
          <ul>
            <li>
              <a href="#org00252ae">1. Configuration</a>
              <ul>
                <li>
                  <a href="#orgac3fec1">1.1. Personal
                  information</a>
                </li>
                <li>
                  <a href="#org94c4b4e">1.2. Doom core</a>
                </li>
              </ul>
            </li>
            <li>
              <a href="#org2686597">2. Modules</a>
              <ul>
                <li>
                  <a href="#org17451a0">2.1. Org mode</a>
                </li>
                <li>
                  <a href="#org25d0dde">2.2. Evil-snipe</a>
                </li>
                <li>
                  <a href="#org3c249cb">2.3. LSP</a>
                </li>
                <li>
                  <a href="#org5b02957">2.4. Magit</a>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org00252ae" class="outline-2">
        <h2 id="org00252ae">
        <span class="section-number-2">1</span>Configuration</h2>
        <div class="outline-text-2" id="text-1"></div>
        <div id="outline-container-orgac3fec1" class="outline-3">
          <h3 id="orgac3fec1">
          <span class="section-number-3">1.1</span>Personal
          information</h3>
          <div class="outline-text-3" id="text-1-1">
            <div class="org-src-container">
              <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">user-full-name</span> 
<span style="color: #98be65;">"Yarin miran"</span>
      
<span style="color: #dcaeea;">user-mail-address</span> 
<span style="color: #98be65;">"yarin@beyond.security"</span>
<span style="color: #51afef;">)</span>

</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org94c4b4e" class="outline-3">
          <h3 id="org94c4b4e">
          <span class="section-number-3">1.2</span>Doom core</h3>
          <div class="outline-text-3" id="text-1-2"></div>
          <div id="outline-container-orgc4631c2" class="outline-4">
            <h4 id="orgc4631c2">
            <span class="section-number-4">1.2.1</span>Theme</h4>
            <div class="outline-text-4" id="text-1-2-1">
              <div class="org-src-container">
                <pre class="src src-emacs-lisp">
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">Doom exposes five (optional)
variables for controlling fonts in Doom. Here</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">are the three important ones:</span>
<span style="color: #5B6268;">;;</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">+ `</span>
<span style="color: #a9a1e1;">doom-font</span>
<span style="color: #5B6268;">'</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">+ `</span>
<span style="color: #a9a1e1;">doom-variable-pitch-font</span>
<span style="color: #5B6268;">'</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">+ `</span>
<span style="color: #a9a1e1;">doom-big-font</span>
<span style="color: #5B6268;">' -- used for `</span>
<span style="color: #a9a1e1;">doom-big-font-mode</span>
<span style="color: #5B6268;">'; use this for</span>
<span style="color: #5B6268;">;;   </span>
<span style="color: #5B6268;">presentations or streaming.</span>
<span style="color: #5B6268;">;;</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">They all accept either a font-spec,
font string ("Input Mono-12"), or xlfd</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">font string. You generally only need
these two:</span>
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">doom-font</span> 
<span style="color: #c678dd;">(</span>
<span style="color: #a9a1e1;">font-spec</span> 
<span style="color: #c678dd;">:family</span> 
<span style="color: #98be65;">"monospace"</span> 
<span style="color: #c678dd;">:size</span> 
<span style="color: #da8548; font-weight: bold;">14</span>
<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>

<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">There are two ways to load a theme.
Both assume the theme is installed and</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">available. You can either set
`</span>
<span style="color: #a9a1e1;">doom-theme</span>
<span style="color: #5B6268;">' or manually load a theme with
the</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">`</span>
<span style="color: #a9a1e1;">load-theme</span>
<span style="color: #5B6268;">' function. This is the
default:</span>
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">doom-theme</span> 
<span style="color: #51afef;">'</span>
<span style="color: #ECBE7B;">doom-one</span>
<span style="color: #51afef;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-org88b6566" class="outline-4">
            <h4 id="org88b6566">
            <span class="section-number-4">1.2.2</span>File
            types</h4>
            <div class="outline-text-4" id="text-1-2-2"></div>
            <ol class="org-ol">
              <li>
              <a id="org581a4bb"></a>YAML go templates
              <br />
              <div class="outline-text-5" id="text-1-2-2-1">
                <div class="org-src-container">
                  <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #c678dd;">add-to-list</span> 
<span style="color: #51afef;">'</span>
<span style="color: #dcaeea;">auto-mode-alist</span> 
<span style="color: #51afef;">'</span>
<span style="color: #c678dd;">(</span>
<span style="color: #98be65;">"\\.yaml</span>
<span style="color: #ECBE7B;">\</span>
<span style="color: #98be65;">.gotmpl\\'"</span> . yaml-mode
<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>
</pre>
                </div>
              </div></li>
            </ol>
          </div>
          <div id="outline-container-orge3dca33" class="outline-4">
            <h4 id="orge3dca33">
            <span class="section-number-4">
            1.2.3</span>Keybindings</h4>
            <div class="outline-text-4" id="text-1-2-3"></div>
            <ol class="org-ol">
              <li>
              <a id="org4202d0d"></a>Easy window navigation
              <br />
              <div class="outline-text-5" id="text-1-2-3-1">
                <div class="org-src-container">
                  <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">map!</span>

<span style="color: #c678dd;">(</span>
<span style="color: #c678dd;">:map</span> 
<span style="color: #dcaeea;">evil-window-map</span>
   
<span style="color: #98be65;">"&lt;left&gt;"</span>   
<span style="color: #51afef;">#'</span>
<span style="color: #ECBE7B;">evil-window-left</span>
   
<span style="color: #98be65;">"&lt;down&gt;"</span>   
<span style="color: #51afef;">#'</span>
<span style="color: #ECBE7B;">evil-window-down</span>
   
<span style="color: #98be65;">"&lt;up&gt;"</span>   
<span style="color: #51afef;">#'</span>
<span style="color: #ECBE7B;">evil-window-up</span>
   
<span style="color: #98be65;">"&lt;right&gt;"</span>   
<span style="color: #51afef;">#'</span>
<span style="color: #ECBE7B;">evil-window-right</span>
<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>
</pre>
                </div>
              </div></li>
              <li>
              <a id="org289da7a"></a>Open treemacs
              <br />
              <div class="outline-text-5" id="text-1-2-3-2">
                <div class="org-src-container">
                  <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">map!</span> 
<span style="color: #98be65;">"&lt;f4&gt;"</span> 
<span style="color: #51afef;">#'</span>
<span style="color: #ECBE7B;">treemacs</span>
<span style="color: #51afef;">)</span>
</pre>
                </div>
              </div></li>
            </ol>
          </div>
          <div id="outline-container-org144ab03" class="outline-4">
            <h4 id="org144ab03">
            <span class="section-number-4">1.2.4</span>Editor</h4>
            <div class="outline-text-4" id="text-1-2-4"></div>
            <ol class="org-ol">
              <li>
              <a id="orgfd81b01"></a>Display line numbers
              <br />
              <div class="outline-text-5" id="text-1-2-4-1">
                <div class="org-src-container">
                  <pre class="src src-emacs-lisp">
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">This determines the style of line
numbers in effect. If set to `</span>
<span style="color: #a9a1e1;">nil</span>
<span style="color: #5B6268;">', line</span>
<span style="color: #5B6268;">;; </span>
<span style="color: #5B6268;">numbers are disabled. For relative
line numbers, set this to `</span>
<span style="color: #a9a1e1;">relative</span>
<span style="color: #5B6268;">'.</span>
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">display-line-numbers-type</span> 
<span style="color: #51afef;">'</span>
<span style="color: #ECBE7B;">relative</span>
<span style="color: #51afef;">)</span>
</pre>
                </div>
              </div></li>
              <li>
              <a id="org5e599df"></a>Multi edit
              <br />
              <div class="outline-text-5" id="text-1-2-4-2">
                <p>#+BEGIN
                <sub>SRC</sub>emacs-lisp ;; Highlights all matches
                of the selection in the buffer. (define-key
                evil-visual-state-map &#8220;R&#8221;
                &#8217;evil-multiedit-match-all)</p>
                <p>;; Match the word under cursor (i.e. make it an
                edit region). Consecutive presses will ;;
                incrementally add the next unmatched match.
                (define-key evil-normal-state-map (kbd
                &#8220;M-d&#8221;)
                &#8217;evil-multiedit-match-and-next) ;; Match
                selected region. (define-key evil-visual-state-map
                (kbd &#8220;M-d&#8221;)
                &#8217;evil-multiedit-match-and-next) ;; Insert
                marker at point (define-key evil-insert-state-map
                (kbd &#8220;M-d&#8221;)
                &#8217;evil-multiedit-toggle-marker-here)</p>
                <p>;; Same as M-d but in reverse. (define-key
                evil-normal-state-map (kbd &#8220;M-D&#8221;)
                &#8217;evil-multiedit-match-and-prev) #+END
                <sub>SRC</sub>** Doom modules</p>
              </div></li>
            </ol>
          </div>
        </div>
      </div>
      <div id="outline-container-org2686597" class="outline-2">
        <h2 id="org2686597">
        <span class="section-number-2">2</span>Modules</h2>
        <div class="outline-text-2" id="text-2"></div>
        <div id="outline-container-org17451a0" class="outline-3">
          <h3 id="org17451a0">
          <span class="section-number-3">2.1</span>Org mode</h3>
          <div class="outline-text-3" id="text-2-1"></div>
          <div id="outline-container-orge860472" class="outline-4">
            <h4 id="orge860472">
            <span class="section-number-4">2.1.1</span>Paths</h4>
            <div class="outline-text-4" id="text-2-1-1">
              <div class="org-src-container">
                <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">org-directory</span> 
<span style="color: #98be65;">"~/workspace/org/"</span>
<span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> deft-directory 
<span style="color: #98be65;">"~/workspace/org/"</span>
<span style="color: #51afef;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-org086c20c" class="outline-4">
            <h4 id="org086c20c">
            <span class="section-number-4">2.1.2</span>To do
            keywords</h4>
            <div class="outline-text-4" id="text-2-1-2">
              <div class="org-src-container">
                <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">after!</span> org
  
<span style="color: #c678dd;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">org-todo-keywords</span> 
<span style="color: #51afef;">'</span>
<span style="color: #98be65;">(</span>
<span style="color: #51afef;">(</span>sequence 
<span style="color: #98be65;">"</span>
<span style="color: #ECBE7B; font-weight: bold;">TODO</span>
<span style="color: #98be65;">(t)"</span> 
<span style="color: #98be65;">"INPROG(i!)"</span> 
<span style="color: #98be65;">"BLOCKED(b!)"</span> 
<span style="color: #98be65;">"|"</span> 
<span style="color: #98be65;">"DONE(d!)"</span> 
<span style="color: #98be65;">"DISCARDED"</span>
<span style="color: #51afef;">)</span>
<span style="color: #98be65;">)</span>
        
<span style="color: #dcaeea;">org-todo-keyword-faces</span>
                          
<span style="color: #51afef;">'</span>
<span style="color: #98be65;">(</span>
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"</span>
<span style="color: #ECBE7B; font-weight: bold;">TODO</span>
<span style="color: #98be65;">"</span> 
<span style="color: #c678dd;">:foreground</span> 
<span style="color: #98be65;">"Spring green"</span> 
<span style="color: #c678dd;">:weight</span> bold
<span style="color: #51afef;">)</span>
                            
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"INPROG"</span> 
<span style="color: #c678dd;">:foreground</span> 
<span style="color: #98be65;">"Gold"</span> 
<span style="color: #c678dd;">:weight</span> bold
<span style="color: #51afef;">)</span>
                            
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"BLOCKED"</span> 
<span style="color: #c678dd;">:foreground</span> 
<span style="color: #98be65;">"Indian red"</span> 
<span style="color: #c678dd;">:weight</span> bold
<span style="color: #51afef;">)</span>
                            
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"DONE"</span> 
<span style="color: #c678dd;">:foreground</span> 
<span style="color: #98be65;">"slategrey"</span> 
<span style="color: #c678dd;">:weight</span> bold 
<span style="color: #c678dd;">:strike-through</span> t
<span style="color: #51afef;">)</span>
                            
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"DISCARDED"</span> 
<span style="color: #c678dd;">:foreground</span> 
<span style="color: #98be65;">"slategrey"</span> 
<span style="color: #c678dd;">:weight</span> bold 
<span style="color: #c678dd;">:strike-through</span> t
<span style="color: #51afef;">)</span>
                            
<span style="color: #98be65;">)</span>
  
<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>

</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-orgdda772d" class="outline-4">
            <h4 id="orgdda772d">
            <span class="section-number-4">2.1.3</span>Link
            types</h4>
            <div class="outline-text-4" id="text-2-1-3">
              <div class="org-src-container">
                <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">after!</span> org
  
<span style="color: #c678dd;">(</span>
<span style="color: #c678dd;">add-to-list</span> 
<span style="color: #51afef;">'</span>
<span style="color: #dcaeea;">org-link-abbrev-alist</span> 
<span style="color: #51afef;">'</span>
<span style="color: #98be65;">(</span>
<span style="color: #98be65;">"jira"</span> . 
<span style="color: #98be65;">
"https://beyondnetworks.atlassian.net/browse/BE-%s"</span>
<span style="color: #98be65;">)</span>
<span style="color: #c678dd;">)</span>
  
<span style="color: #c678dd;">(</span>
<span style="color: #c678dd;">add-to-list</span> 
<span style="color: #51afef;">'</span>
<span style="color: #dcaeea;">org-link-abbrev-alist</span> 
<span style="color: #51afef;">'</span>
<span style="color: #98be65;">(</span>
<span style="color: #98be65;">"pr"</span> . 
<span style="color: #98be65;">
"https://github.com/beyondnetworks/beyond/pull/%s"</span>
<span style="color: #98be65;">)</span>
<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>
</pre>
              </div>
            </div>
          </div>
          <div id="outline-container-org42b7748" class="outline-4">
            <h4 id="org42b7748">
            <span class="section-number-4">2.1.4</span>Capture
            templates</h4>
            <div class="outline-text-4" id="text-2-1-4">
              <div class="org-src-container">
                <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">after!</span> org
  
<span style="color: #c678dd;">(</span>
<span style="color: #51afef;">defvar</span> 
<span style="color: #dcaeea;">my-task-file</span> 
<span style="color: #98be65;">(</span>
<span style="color: #a9a1e1;">format</span> 
<span style="color: #98be65;">"%stasks.org"</span> 
<span style="color: #dcaeea;">org-directory</span>
<span style="color: #98be65;">)</span>
<span style="color: #c678dd;">)</span>
  
<span style="color: #c678dd;">(</span>
<span style="color: #51afef;">defvar</span> 
<span style="color: #dcaeea;">my-notes-file</span> 
<span style="color: #98be65;">(</span>
<span style="color: #a9a1e1;">format</span> 
<span style="color: #98be65;">"%snotes.org"</span> 
<span style="color: #dcaeea;">org-directory</span>
<span style="color: #98be65;">)</span>
<span style="color: #c678dd;">)</span>
  
<span style="color: #c678dd;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">org-capture-templates</span>
               
<span style="color: #51afef;">'</span>
<span style="color: #98be65;">(</span>
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"t"</span> 
<span style="color: #98be65;">"Work related task"</span> entry
                 
<span style="color: #c678dd;">(</span>file+headline 
<span style="color: #dcaeea;">my-task-file</span> 
<span style="color: #98be65;">"Tasks"</span>
<span style="color: #c678dd;">)</span> 
<span style="color: #98be65;">"* </span>
<span style="color: #ECBE7B; font-weight: bold;">TODO</span>
<span style="color: #98be65;"> %?"</span> 
<span style="color: #c678dd;">:prepend</span> t
<span style="color: #51afef;">)</span>
                
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"p"</span> 
<span style="color: #98be65;">"New project"</span> entry
                 
<span style="color: #c678dd;">(</span>file+headline 
<span style="color: #dcaeea;">my-task-file</span> 
<span style="color: #98be65;">"Projects"</span>
<span style="color: #c678dd;">)</span> 
<span style="color: #98be65;">"* %?"</span> 
<span style="color: #c678dd;">:prepend</span> t
<span style="color: #51afef;">)</span>
                
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"r"</span> 
<span style="color: #98be65;">"Pull request to review"</span> entry
                 
<span style="color: #c678dd;">(</span>file+headline 
<span style="color: #dcaeea;">my-task-file</span> 
<span style="color: #98be65;">"PRs to review"</span>
<span style="color: #c678dd;">)</span> 
<span style="color: #98be65;">"* </span>
<span style="color: #ECBE7B; font-weight: bold;">TODO</span>
<span style="color: #98be65;"> %? [[pr:%^{id}][PR %\\1]]\nCREATED:
%T"</span> 
<span style="color: #c678dd;">:prepend</span> t
<span style="color: #51afef;">)</span>
                
<span style="color: #51afef;">(</span>
<span style="color: #98be65;">"R"</span> 
<span style="color: #98be65;">"Read later"</span> entry
                 
<span style="color: #c678dd;">(</span>file+headline 
<span style="color: #dcaeea;">my-notes-file</span> 
<span style="color: #98be65;">"Read later"</span>
<span style="color: #c678dd;">)</span> 
<span style="color: #98be65;">"* [[%^{link}][%?]]\nCREATED:
%T"</span> 
<span style="color: #c678dd;">:prepend</span> t
<span style="color: #51afef;">)</span>
<span style="color: #98be65;">)</span>
  
<span style="color: #c678dd;">)</span>
<span style="color: #51afef;">)</span>
</pre>
              </div>
            </div>
          </div>
        </div>
        <div id="outline-container-org25d0dde" class="outline-3">
          <h3 id="org25d0dde">
          <span class="section-number-3">2.2</span>Evil-snipe</h3>
          <div class="outline-text-3" id="text-2-2">
            <p>Disable evil snipe in mgait buffers due to a bug</p>
            <div class="org-src-container">
              <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #c678dd;">add-hook</span> 
<span style="color: #51afef;">'</span>
<span style="color: #dcaeea;">magit-mode-hook</span> 
<span style="color: #51afef;">'</span>
<span style="color: #ECBE7B;">
turn-off-evil-snipe-override-mode</span>
<span style="color: #51afef;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org3c249cb" class="outline-3">
          <h3 id="org3c249cb">
          <span class="section-number-3">2.3</span>LSP</h3>
          <div class="outline-text-3" id="text-2-3">
            <div class="org-src-container">
              <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">lsp-auto-guess-root</span> nil
<span style="color: #51afef;">)</span>
</pre>
            </div>
          </div>
        </div>
        <div id="outline-container-org5b02957" class="outline-3">
          <h3 id="org5b02957">
          <span class="section-number-3">2.4</span>Magit</h3>
          <div class="outline-text-3" id="text-2-4">
            <p>Commit max length</p>
            <div class="org-src-container">
              <pre class="src src-emacs-lisp">
<span style="color: #51afef;">(</span>
<span style="color: #51afef;">setq</span> 
<span style="color: #dcaeea;">git-commit-summary-max-length</span> 
<span style="color: #da8548; font-weight: bold;">160</span>
<span style="color: #51afef;">)</span>
</pre>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="date">Date: 2020-04-25 Sat 00:00</p>
      <p class="author">Author: Yarin miran</p>
      <p class="date">Created: 2020-04-25 Sat 10:22</p>
    </div>
  </body>
</html>
